# Erase Method (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
CategorySet..::..Erase Method
CategorySet Class See Also
---
Removes a specified category from the set.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public virtual int Erase(
	Category item
)
```

Visual Basic
---
```text
Public Overridable Function Erase ( _
	item As Category _
) As Integer
```

Visual C++
---
```text
public:
virtual int Erase(
	Category^ item
)
```

# ### Parameters
item
    Type: Autodesk.Revit.DB..::..CategoryThe category to be erased.
# ### Return Value
The number of items that were erased from the set.
# See Also
CategorySet Class
Autodesk.Revit.DB Namespace